simple_blog/app/controllers/posts_controller.rb

     def create
        @post = Post.new(post_params)
       if(@post.save)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "post 2"], ["body", "i am herro"], ["created_at", "2019-09-08 11:38:13.245101"], ["updated_at", "2019-09-08 11:38:13.245101"]]