simple_blog/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
 <h3>comments</h3>
 <% @post.comments.each do |comment| %